[
    {
        "unidad":"CRISP-DM",
        "tarea":"PD1",
        "descripcion":"En la siguiente práctica se realizaron tutoriales de RapidMiner para manejo de missing values, normalización y detección de outliers. Además utilizó esta herramienta para trabajar sobre normalización con el dataset Wine."    },
    {
        "unidad":"CRISP-DM",
        "tarea":"PD2",
        "descripcion":"En este ejercicio se hicieron tutoriales de modelado, scoring, split y validación, cross validation y visual model comparison para la herramienta RapidMiner."
    },
    {
        "unidad":"CRISP-DM",
        "tarea":"PD3",
        "descripcion":"Para este caso se aplican técnicas de pre procesamiento como normalización, estandarización y split en datos de entrenamiento y test. Luego se obtuvieron estadísticas para el dataset Wine utiliando funciones de Python con SciKitLearn y la librería Pandas."
    },
    {
        "unidad":"CRISP-DM",
        "tarea":"PD4",
        "descripcion":"Remoción de missing values, construcción de un modelo de predicción para el dataset Titanic y creación de un programa que responda a consultas sobre el dataset mencionado."
    },
    {
        "unidad":"Algoritmos lineales",
        "tarea":"PD1",
        "descripcion":"Utilizando una planilla electrónica se generó un modelo de regresión linear simple calculando los coeficientes en el primer ejercicio y por descenso de gradiente en el segundo ejercicio. Para ambos casos se hizo uso de los modelos para hacer predicciones."
    },
    {
        "unidad":"Algoritmos lineales",
        "tarea":"PD2",
        "descripcion":"En una planilla electrónica se visualizará una función logística y se genararán modelos de regresión logística con descenso de gradiente estocástico."
    },
    {
        "unidad":"Algoritmos lineales",
        "tarea":"PD3",
        "descripcion":"Empleando una planilla electrónica se generará un modelo de análisis de discriminante lineal LDA y con él se hará la predicción de clase para un conjunto de datos con un atributo y una salida con dos clases."
    },
    {
        "unidad":"Algoritmos lineales",
        "tarea":"PD4",
        "descripcion":"En este ejercicio se usa una planilla electrónica para minimizar una función siguiendo los gradientes de la función de costo a partir de lo cual armar un modelo de regresión lineal."
    },
    {
        "unidad":"Algoritmos lineales",
        "tarea":"PD5",
        "descripcion":"Utilizaremos Análisis de Discriminante Lineal (LDA) con Sckit-learn de Python y RapidMiner para entrenar y realizar la clasificación a partir del dataset de Sports para finalmente comparar las predicciones realizadas por ambos modelos."
    },
    {
        "unidad":"Algoritmos no lineales",
        "tarea":"PD1",
        "descripcion":"Emplearemos un modelo CART para un problema de clasificación binaria simple con dos variables de entrada X1 y X2 y una variable de salida Y."
    },
    {
        "unidad":"Algoritmos no lineales",
        "tarea":"PD2",
        "descripcion":"Estudiaremos la construcción de un modelo de árbol de decisión de regresión simple en la herramienta KNIME."
    },
    {
        "unidad":"Algoritmos no lineales",
        "tarea":"PD3",
        "descripcion":"En una hoja de cálculo analizaremos paso a paso el algoritmo de Support Vector Machines lineal con descenso de sub gradiente y lo utilizaremos para realizar predicciones."
    },
    {
        "unidad":"Algoritmos no lineales",
        "tarea":"PD4",
        "descripcion":"En este ejercicio se analizará el componente SVM de RapidMiner y se lo utilizará para resolver un problema no separable linealmente."
    },
    {
        "unidad":"Algoritmos no lineales",
        "tarea":"PD5",
        "descripcion":"Comparación de árboles de decisión entre RapidMiner y Weka aplicados al dataset Iris. Además se analiza este componente en Azure ML Studio, KNIME y Python Sci kit learn."
    },
    {
        "unidad":"Algoritmos no lineales",
        "tarea":"PD8",
        "descripcion":"Empleo del algoritmo KNN para realizar predicciones en una hoja de cálculo y RapidMiner."
    },
    {
        "unidad":"Algoritmos no lineales",
        "tarea":"PD9",
        "descripcion":"Ejercicio con selección de atributos en RapidMiner."    
    }     
]