[
    {
        "unidad":"Preparación de datos",
        "tarea":"Normalización sobre dataset Wine en RapidMiner",
        "descripcion":"En RapidMiner se realizó una normalización sobre el dataset Wine y se comparó la performance de aplicar Naive Bayes usando el dataset normalizado y no normalizado con un split con el 70% de ejemplos para training y 30% para test en ambos casos."
    },
    {
        "unidad":"Preparación de datos",
        "tarea":"Tutoriales de preparación de datos en RapidMiner",
        "descripcion":"En este ejercicio se hicieron tutoriales de modelado, scoring, split y validación, cross validation y visual model comparison para la herramienta RapidMiner."
    },
    {
        "unidad":"Preparación de datos",
        "tarea":"Pre procesamiento de datos con Python",
        "descripcion":"Para este caso se aplican técnicas de pre procesamiento como normalización, estandarización y split en datos de training y test. Luego se obtienen estadísticas para el dataset Wine utiliando funciones de Python con SciKitLearn y la librería Pandas."
    },
    {
        "unidad":"Preparación de datos",
        "tarea":"Data pre processing y cálculo de probabilidades de sucesos sobre el dataset Titanic con Python",
        "descripcion":"Sobre el dataset Titanic se realizó un tratamiento de missing values con reemplazo, remoción, sustitución por categoría única y selección de atributos. Posteriormente se realizaron consultas probabilísticas sobre los datos."
    },
    {
        "unidad":"Preparación de datos",
        "tarea":"Selección de atributos para dataset Sonar",
        "descripcion":"Ejercicio con selección de atributos en RapidMiner sobre el dataset Sonar."    
    },
    {
        "unidad":"Algoritmos lineales",
        "tarea":"Titanic",
        "descripcion":"En este caso se hace un estudio de preparación de datos para el dataset Titanic y se crean modelos de regresión logística equivalentes para RapidMiner y SciKitLearn."
    },
    {
        "unidad":"Algoritmos lineales",
        "tarea":"Deportes",
        "descripcion":"Utilizaremos Análisis de Discriminante Lineal (LDA) con Sckit-learn de Python y RapidMiner para entrenar y realizar la clasificación a partir del dataset de Sports para finalmente comparar las predicciones realizadas por ambos modelos."
    },
    {
        "unidad":"Algoritmos lineales",
        "tarea":"Regresión lineal simple en hoja de cálculo",
        "descripcion":"Utilizando una planilla electrónica se generó un modelo de regresión linear simple calculando los coeficientes en el primer ejercicio y por descenso de gradiente en el segundo ejercicio. Para ambos casos se usaron los modelos para hacer predicciones."
    },
    {
        "unidad":"Algoritmos lineales",
        "tarea":"Regresión logística en planilla electrónica",
        "descripcion":"En una planilla electrónica se visualizará una función logística y se genararán modelos de regresión logística con descenso de gradiente estocástico."
    },
    {
        "unidad":"Algoritmos lineales",
        "tarea":"LDA en hoja de cálculo",
        "descripcion":"Empleando una planilla electrónica se generará un modelo de análisis de discriminante lineal LDA y con él se hará la predicción de clase para un conjunto de datos con un atributo y una salida con dos clases."
    },
    {
        "unidad":"Algoritmos lineales",
        "tarea":"Regresión lineal con descenso de gradiente",
        "descripcion":"En este ejercicio se usa una planilla electrónica para minimizar una función siguiendo los gradientes de la función de costo y luego armar un modelo de regresión lineal."
    },
    {
        "unidad":"Algoritmos lineales",
        "tarea":"Comparación de LDA con Python y RapidMiner para el dataset Sports",
        "descripcion":"Se realizan ejercicios con modelos de LDA para en Python y RapidMiner y se comparan los resultados obtenidos."
    },
    {
        "unidad":"Algoritmos no lineales",
        "tarea":"CART para clasificación binaria simple",
        "descripcion":"Emplearemos un modelo CART para un problema de clasificación binaria simple con dos variables de entrada X1 y X2 y una variable de salida Y."
    },
    {
        "unidad":"Algoritmos no lineales",
        "tarea":"Árboles de decisión en KNIME",
        "descripcion":"Estudiaremos la construcción de un modelo de árbol de decisión de regresión simple en la herramienta KNIME."
    },
    {
        "unidad":"Algoritmos no lineales",
        "tarea":"SVM lineal con descenso de sub gradiente",
        "descripcion":"En una hoja de cálculo analizaremos el algoritmo de Support Vector Machines lineal con descenso de sub gradiente y lo utilizaremos para realizar predicciones."
    },
    {
        "unidad":"Algoritmos no lineales",
        "tarea":"SVM no lineal en RapidMiner",
        "descripcion":"En este ejercicio se analizará el componente SVM de RapidMiner y se lo utilizará para resolver un problema no separable linealmente."
    },
    {
        "unidad":"Algoritmos no lineales",
        "tarea":"Comparación de Decision Trees en herramientas de ML",
        "descripcion":"Comparación de árboles de decisión entre RapidMiner y Weka aplicados al dataset Iris. Además se analiza el componente mencionado en Azure ML Studio, KNIME y Python Sci kit learn."
    },
    {
        "unidad":"Algoritmos no lineales",
        "tarea":"Naive Bayes en planilla electrónica",
        "descripcion":"Implementación de un modelo de Naive Bayes en una planilla electrónica."
    },
    {
        "unidad":"Algoritmos no lineales",
        "tarea":"KNN en hoja de cálculo y RapidMiner",
        "descripcion":"Empleo de KNN para realizar predicciones en una hoja de cálculo y RapidMiner."
    },
    {
        "unidad":"No supervisado",
        "tarea":"DBSCAN en Wine",
        "descripcion":"Aplicamos el algoritmo de clustering DBSCAN para encontrar agrupaciones en el dataet Wine"
    },
    {
        "unidad":"No supervisado",
        "tarea":"PCA para dataset Cereals",
        "descripcion":"Estudio del algoritmo PCA utilizando los datos de Cereals"
    }
]